// //  Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго.
// a = 25, b = 5 -> да 
// a = 2, b = 10 -> нет 
// a = 9, b = -3 -> да 
// a = -3, b = 9 -> нет
// Напишите программу, которая будет выдавать название дня недели по заданному номеру.
// 	3 -> Среда 
// 5 -> Пятница

using System;

Console.WriteLine("введите первое число:");
string? numberStringOne = Console.ReadLine();

Console.WriteLine("введите второе число:");
string? numberStringTwo = Console.ReadLine();

int numberIntOne = Convert.ToInt32(numberStringOne);
int numberIntTwo = Convert.ToInt32(numberStringTwo);
if (numberIntTwo * numberIntTwo == numberIntOne)
{
    Console.WriteLine("Да");
}
else
{
    Console.WriteLine("Нет");
}







    
